Revit 2027 API
ParameterTypeId.DividedSurfacePattern Property
 "Tile Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfacePattern { get; }
Public Shared ReadOnly Property DividedSurfacePattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfacePattern {
	ForgeTypeId^ get ();
}
static member DividedSurfacePattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace